// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// Console.WriteLine("Hello, World!");
// Console.ReadLine("")

Console.Clear();

Console.Write("Enter our Number: ");        // Вводим наше число в виде строки и выводим второй элемент этой строки
string num = Console.ReadLine();

Console.WriteLine(num[1]);